randrw/1-node/randrw4.log
random-writers: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=4
...
fio-3.27-32-g77c7-dirty
Starting 4 processes
random-writers: Laying out IO file (1 file / 1024MiB)
random-writers: Laying out IO file (1 file / 1024MiB)

random-writers: (groupid=0, jobs=1): err= 0: pid=161088: Tue Jul 13 11:27:25 2021
  read: IOPS=764, BW=23.9MiB/s (25.0MB/s)(7167MiB/300054msec)
    slat (usec): min=15, max=352303, avg=1018.43, stdev=2934.33
    clat (usec): min=75, max=955635, avg=1992.85, stdev=9115.72
     lat (usec): min=93, max=955984, avg=3013.59, stdev=9732.96
    clat percentiles (usec):
     |  1.00th=[   212],  5.00th=[   338], 10.00th=[   429], 20.00th=[   562],
     | 30.00th=[   734], 40.00th=[  1303], 50.00th=[  1450], 60.00th=[  1614],
     | 70.00th=[  1893], 80.00th=[  2343], 90.00th=[  2900], 95.00th=[  4621],
     | 99.00th=[ 10945], 99.50th=[ 14222], 99.90th=[ 55313], 99.95th=[ 94897],
     | 99.99th=[708838]
   bw (  KiB/s): min=   64, max=42304, per=24.17%, avg=24795.80, stdev=9292.55, samples=592
   iops        : min=    2, max= 1322, avg=774.86, stdev=290.39, samples=592
  write: IOPS=764, BW=23.9MiB/s (25.1MB/s)(7169MiB/300054msec); 0 zone resets
    slat (usec): min=97, max=159503, avg=206.36, stdev=844.60
    clat (usec): min=24, max=982851, avg=1943.38, stdev=8481.40
     lat (usec): min=208, max=983145, avg=2151.06, stdev=8528.38
    clat percentiles (usec):
     |  1.00th=[   204],  5.00th=[   285], 10.00th=[   383], 20.00th=[   502],
     | 30.00th=[   644], 40.00th=[  1270], 50.00th=[  1418], 60.00th=[  1565],
     | 70.00th=[  1860], 80.00th=[  2311], 90.00th=[  2900], 95.00th=[  4621],
     | 99.00th=[ 10945], 99.50th=[ 14222], 99.90th=[ 54789], 99.95th=[ 95945],
     | 99.99th=[274727]
   bw (  KiB/s): min=   64, max=46912, per=24.14%, avg=24800.25, stdev=9337.78, samples=592
   iops        : min=    2, max= 1466, avg=775.00, stdev=291.80, samples=592
  lat (usec)   : 50=0.01%, 100=0.66%, 250=1.85%, 500=14.97%, 750=13.35%
  lat (usec)   : 1000=0.81%
  lat (msec)   : 2=40.90%, 4=21.90%, 10=4.03%, 20=1.24%, 50=0.18%
  lat (msec)   : 100=0.07%, 250=0.03%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=2.95%, sys=32.59%, ctx=152844, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=229357,229396,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=161089: Tue Jul 13 11:27:25 2021
  read: IOPS=817, BW=25.6MiB/s (26.8MB/s)(7668MiB/300022msec)
    slat (usec): min=15, max=371947, avg=942.83, stdev=2745.02
    clat (usec): min=16, max=972851, avg=1844.60, stdev=8368.10
     lat (usec): min=93, max=974223, avg=2789.16, stdev=8994.14
    clat percentiles (usec):
     |  1.00th=[   145],  5.00th=[   297], 10.00th=[   392], 20.00th=[   506],
     | 30.00th=[   635], 40.00th=[  1172], 50.00th=[  1319], 60.00th=[  1467],
     | 70.00th=[  1696], 80.00th=[  2114], 90.00th=[  2704], 95.00th=[  4621],
     | 99.00th=[ 10945], 99.50th=[ 14222], 99.90th=[ 52167], 99.95th=[ 86508],
     | 99.99th=[358613]
   bw (  KiB/s): min=  576, max=46144, per=26.12%, avg=26797.48, stdev=10928.77, samples=586
   iops        : min=   18, max= 1442, avg=837.41, stdev=341.52, samples=586
  write: IOPS=820, BW=25.6MiB/s (26.9MB/s)(7693MiB/300022msec); 0 zone resets
    slat (usec): min=98, max=160088, avg=200.52, stdev=903.23
    clat (usec): min=80, max=1029.5k, avg=1828.34, stdev=8579.57
     lat (usec): min=208, max=1029.7k, avg=2030.30, stdev=8649.88
    clat percentiles (usec):
     |  1.00th=[   105],  5.00th=[   269], 10.00th=[   367], 20.00th=[   465],
     | 30.00th=[   594], 40.00th=[  1156], 50.00th=[  1303], 60.00th=[  1434],
     | 70.00th=[  1663], 80.00th=[  2147], 90.00th=[  2704], 95.00th=[  4621],
     | 99.00th=[ 10945], 99.50th=[ 14484], 99.90th=[ 53740], 99.95th=[ 86508],
     | 99.99th=[238027]
   bw (  KiB/s): min=  576, max=47168, per=26.17%, avg=26885.59, stdev=11067.42, samples=586
   iops        : min=   18, max= 1474, avg=840.17, stdev=345.85, samples=586
  lat (usec)   : 20=0.01%, 100=0.86%, 250=2.23%, 500=18.05%, 750=13.12%
  lat (usec)   : 1000=1.35%
  lat (msec)   : 2=40.97%, 4=17.99%, 10=3.94%, 20=1.24%, 50=0.16%
  lat (msec)   : 100=0.07%, 250=0.03%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=2.81%, sys=31.73%, ctx=151375, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=245372,246176,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=161090: Tue Jul 13 11:27:25 2021
  read: IOPS=851, BW=26.6MiB/s (27.9MB/s)(7987MiB/300001msec)
    slat (usec): min=15, max=339855, avg=892.75, stdev=2748.11
    clat (usec): min=14, max=950709, avg=1784.07, stdev=8655.47
     lat (usec): min=94, max=951914, avg=2678.64, stdev=9235.11
    clat percentiles (usec):
     |  1.00th=[   120],  5.00th=[   302], 10.00th=[   392], 20.00th=[   502],
     | 30.00th=[   619], 40.00th=[  1139], 50.00th=[  1303], 60.00th=[  1434],
     | 70.00th=[  1631], 80.00th=[  2040], 90.00th=[  2606], 95.00th=[  3851],
     | 99.00th=[ 10683], 99.50th=[ 13566], 99.90th=[ 51119], 99.95th=[ 91751],
     | 99.99th=[700449]
   bw (  KiB/s): min=   64, max=45824, per=26.99%, avg=27685.83, stdev=11236.23, samples=590
   iops        : min=    2, max= 1432, avg=865.18, stdev=351.13, samples=590
  write: IOPS=850, BW=26.6MiB/s (27.9MB/s)(7976MiB/300001msec); 0 zone resets
    slat (usec): min=96, max=247321, avg=205.44, stdev=1233.41
    clat (usec): min=82, max=951575, avg=1750.56, stdev=7874.42
     lat (usec): min=202, max=951724, avg=1957.45, stdev=8001.89
    clat percentiles (usec):
     |  1.00th=[   105],  5.00th=[   269], 10.00th=[   363], 20.00th=[   457],
     | 30.00th=[   570], 40.00th=[  1123], 50.00th=[  1287], 60.00th=[  1418],
     | 70.00th=[  1598], 80.00th=[  2040], 90.00th=[  2606], 95.00th=[  3851],
     | 99.00th=[ 10814], 99.50th=[ 13960], 99.90th=[ 50594], 99.95th=[ 90702],
     | 99.99th=[248513]
   bw (  KiB/s): min=  320, max=46784, per=26.96%, avg=27693.30, stdev=11312.58, samples=589
   iops        : min=   10, max= 1462, avg=865.41, stdev=353.52, samples=589
  lat (usec)   : 20=0.01%, 100=0.86%, 250=2.14%, 500=18.79%, 750=13.55%
  lat (usec)   : 1000=1.25%
  lat (msec)   : 2=42.20%, 4=16.35%, 10=3.48%, 20=1.13%, 50=0.15%
  lat (msec)   : 100=0.06%, 250=0.03%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=3.10%, sys=32.57%, ctx=152280, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=255585,255230,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
random-writers: (groupid=0, jobs=1): err= 0: pid=161091: Tue Jul 13 11:27:25 2021
  read: IOPS=771, BW=24.1MiB/s (25.3MB/s)(7237MiB/300001msec)
    slat (usec): min=15, max=326634, avg=1005.76, stdev=2847.57
    clat (usec): min=23, max=1035.0k, avg=1976.47, stdev=9942.12
     lat (usec): min=92, max=1036.4k, avg=2983.94, stdev=10486.00
    clat percentiles (usec):
     |  1.00th=[   219],  5.00th=[   326], 10.00th=[   424], 20.00th=[   562],
     | 30.00th=[   758], 40.00th=[  1254], 50.00th=[  1385], 60.00th=[  1532],
     | 70.00th=[  1876], 80.00th=[  2212], 90.00th=[  2802], 95.00th=[  4883],
     | 99.00th=[ 11076], 99.50th=[ 15401], 99.90th=[ 55313], 99.95th=[ 93848],
     | 99.99th=[717226]
   bw (  KiB/s): min=  320, max=43776, per=24.55%, avg=25189.23, stdev=9653.99, samples=588
   iops        : min=   10, max= 1368, avg=787.15, stdev=301.69, samples=588
  write: IOPS=774, BW=24.2MiB/s (25.4MB/s)(7261MiB/300001msec); 0 zone resets
    slat (usec): min=100, max=213587, avg=206.40, stdev=1018.55
    clat (usec): min=83, max=982862, avg=1914.52, stdev=7950.51
     lat (usec): min=212, max=983008, avg=2122.36, stdev=8037.25
    clat percentiles (usec):
     |  1.00th=[   208],  5.00th=[   302], 10.00th=[   400], 20.00th=[   529],
     | 30.00th=[   725], 40.00th=[  1254], 50.00th=[  1369], 60.00th=[  1500],
     | 70.00th=[  1860], 80.00th=[  2212], 90.00th=[  2802], 95.00th=[  4948],
     | 99.00th=[ 11076], 99.50th=[ 14746], 99.90th=[ 49021], 99.95th=[ 82314],
     | 99.99th=[214959]
   bw (  KiB/s): min=  384, max=44544, per=24.60%, avg=25270.64, stdev=9754.66, samples=588
   iops        : min=   12, max= 1392, avg=789.70, stdev=304.83, samples=588
  lat (usec)   : 50=0.01%, 100=0.62%, 250=1.61%, 500=14.61%, 750=13.24%
  lat (usec)   : 1000=1.50%
  lat (msec)   : 2=41.54%, 4=21.18%, 10=4.10%, 20=1.28%, 50=0.21%
  lat (msec)   : 100=0.07%, 250=0.03%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=2.79%, sys=31.26%, ctx=155857, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=231588,232340,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=100MiB/s (105MB/s), 23.9MiB/s-26.6MiB/s (25.0MB/s-27.9MB/s), io=29.4GiB (31.5GB), run=300001-300054msec
  WRITE: bw=100MiB/s (105MB/s), 23.9MiB/s-26.6MiB/s (25.1MB/s-27.9MB/s), io=29.4GiB (31.6GB), run=300001-300054msec


Batch Job Summary Report (version 21.01.1) for Job "fioRandrw" (1470604) on tave

Job information (1/2)
-----------------------------------------------------------------------------------------------------
             Submit            Eligible               Start                 End    Elapsed Time limit
------------------- ------------------- ------------------- ------------------- ---------- ----------
2021-07-13T11:22:09 2021-07-13T11:22:09 2021-07-13T11:22:09 2021-07-13T11:27:29   00:05:20   00:15:00
-----------------------------------------------------------------------------------------------------

Job information (2/2)
-------------------------------------------------------------
    Username      Account    Partition   NNodes        Energy
------------ ------------ ------------ -------- -------------
    afilipci         g138       normal        1     42.333 kJ